[
  {
    "name": "   773 Firepuncher rifle  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/773-firepuncher-rifle-main_31877a40.jpeg?region=222%2C0%2C542%2C542",
    "detail": "The preferred weapon of Clone Force 99 sniper Crosshair, even a standard-issue 773 Firepuncher rifle in the hands of regular clone trooper makes for a powerful tool in the fight against the Separatists."
  },
  {
    "name": "   A280 Blaster Rifle  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/a280-blaster-rifle_0d9d74a0.jpeg?region=454%2C0%2C1054%2C1051",
    "detail": "These powerful blaster rifles, known for their impressive power and capable of piercing armor, were used by planetary forces across the galaxy. With their widespread use, it made them easy for the Rebel Alliance to procure on the black market to use against the forces of the Galactic Empire. They were scoped for increased accuracy. BlasTech Industries manufactured them."
  },
  {
    "name": "   A300 blaster rifle  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/solo-db-a-300-blaster-rifle-main-image_8f48060d.jpeg?region=377%2C0%2C878%2C878",
    "detail": "BlasTech’s A300 is a cheap, simple-to-maintain weapon used by armies and security forces across the galaxy. Customers for the A300 and related models have ranged from the Pyke Syndicate to the Rebel Alliance."
  },
  {
    "name": "   Ahsoka's lightsabers  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/ahsokas-lightsabers-main_e306009f.jpeg?region=697%2C0%2C806%2C803",
    "detail": "As a Padawan, Ahsoka Tano used a green-bladed lightsaber, often wielding it in a non-standard reverse grip. Under the tutelage of Anakin Skywalker, Ahsoka became a skilled duelist, and built a second green-bladed lightsaber with a shorter, shoto-style blade. She used this shorter-bladed lightsaber to complement her primary weapon. During her time with the rebellion, Ahsoka used a pair of new lightsabers with white plasma blades."
  },
  {
    "name": "   Amban Sniper Rifle  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/amban-sniper-rifle-main_d7e8335a.jpeg?region=431%2C2%2C542%2C541",
    "detail": "The Mandalorian is outfitted with an assortment of tools at his disposal, including a crude long arm phase-pulse Amban sniper rifle tipped with a forked ion prod electro-bayonet."
  },
  {
    "name": "   Anti-air turbolaser tower  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/anti-air-turbolaser-tower_0917f829.jpeg?region=168%2C0%2C432%2C432",
    "detail": "Among the Empire's most powerful defense weapons, the anti-air turbolaser tower are designed to thwart incoming fighter attacks. Featuring two cannons, it is notable for its range and precision. The Empire commonly lined anti-air turbolaser towers together to create a blockade. Its biggest weakness, however, is a lack of protection from ground-based assaults."
  },
  {
    "name": "   Ap’lek’s vibro-ax  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/apileks-vibro-ax-main_ac5593c2.jpeg?region=280%2C0%2C720%2C720",
    "detail": "Once the property of a feared Mandalorian executioner, Ap’lek’s vibro-ax is now an emblem of the Knights of Ren. Ultrasonic transmission plates vibrate the ax’s blades to give them even greater cutting power."
  },
  {
    "name": "   Arcana Star Map  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/ahsoka-part-1-story-gallery-02_9b504e16.jpeg?region=293%2C1%2C807%2C803",
    "detail": "Beneath the ruins of an ancient temple on Arcana, Ahsoka Tano recovers a delicate star map in the form of a puzzle-like sphere. Once unlocked, the device can reveal a pathway to coordinates in another galaxy, matching the hyperspace migrations of the noble purrgil as well as providing a chance to locate Grand Admiral Thrawn and Ezra Bridger."
  },
  {
    "name": "   Armorer's equipment  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/armorer-s-equipment-main_ccb58bd8.jpeg?region=372%2C0%2C536%2C536",
    "detail": "Hidden far below the surface of the planet Nevarro, the deftly skilled Armorer's cryo-furnace still burns, utilizing an assortment of tools of the trade, from magnetic tongs to a precise gravity hammer, to forge armor in the tradition of the Mandalorian ancestors."
  },
  {
    "name": "   Asajj Ventress's lightsabers  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/asajj-ventress-lightsaber_eb895d06.jpeg?region=398%2C0%2C802%2C800",
    "detail": "Asajj Ventress used a number of lightsabers during her life. As a Padawan, she used a green-bladed lightsaber, switching to a pair of red-bladed lightsabers during her years as Count Dooku’s apprentice. These Sith sabers had curved hilts similar to that of her master’s weapon. Ventress lost her twin sabers in a battle with Barriss Offee in the Coruscant underlevels, forcing her to acquire a new, yellow-bladed lightsaber on the black market."
  },
  {
    "name": "   AT-AC walker  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/the-bad-batch-story-gallery-plan-99-14_6e51153d.jpeg?region=913%2C0%2C814%2C813",
    "detail": "Similar to the AT-ST walker, the AT-AC walkers are deployed to patrol the streets of Ord Mantell and enforce Imperial rule. "
  },
  {
    "name": "   Bacta Suit  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/last-jedi-databank-bacta-suit-main-image_faa88820.jpeg?region=71%2C0%2C538%2C536",
    "detail": "Made of durable flexpoly, bacta suits circulate healing bacta fluid to damaged tissues in situations where a patient can’t be suspended in a full tank. Resistance medics place an unconscious Finn in an emergency bacta suit for the evacuation of D’Qar."
  },
  {
    "name": "   Bacta Tank  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/the-book-of-boba-fett-chapter-1-story-gallery-01_afa14b76.jpeg?region=567%2C0%2C537%2C536",
    "detail": "Bacta tanks were large vessels filled with a liquid healing agent and used to treat seriously injured patients. To promote healing, patients were completely submerged and used breathing masks while recuperating. Clone troopers were treated in bacta at facilities such as the Kaliida Shoals Medical Center. After he was injured by a wampa, Luke Skywalker recovered in a bacta tank at Hoth’s Echo Base. And after claiming the throne of Jabba the Hutt, Boba Fett recuperated in a bacta pod."
  },
  {
    "name": "   Bahryn Meteorite  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/bahryn-meteorite_b6aae9d0.jpeg?region=580%2C0%2C877%2C878",
    "detail": "Unlike common meteorites, the Bahryn meteorite was notable for two traits: light and warmth. Long after impact, a Bahryn meteorite would emit a bright glow and exude heat. After the ISB Agent, Kallus, and the rebel, Zeb Orellios, were stranded on a frigid Geonosis moon, it was a Bahryn meteorite that prevented them from freezing. Kallus kept the rock as a reminder of his experience."
  },
  {
    "name": "   baradium bomb  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/solo-db-baradium-bomb-main-image_3faa191c.jpeg?region=342%2C0%2C877%2C877",
    "detail": "Val’s arsenal as a saboteur includes handmade baradium bombs. The bombs can be magnetically attached to surfaces, and the detonator is keyed to Val’s biological signature. During the Vandor heist, she wires a bridge on a conveyex track with baradium bombs."
  },
  {
    "name": "   Battering Ram Cannon  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/last-jedi-databank-battering-ram-cannon-main-image_7560d705.jpeg?region=424%2C31%2C458%2C458",
    "detail": "The First Order’s battering ram cannon miniaturizes the Death Star’s deadly superlaser, transplanting it into a cylindrical housing that can be airlifted to a planet’s surface and used to blast through any barrier. The First Order uses this deadly siege cannon on Crait, towing it across the salt plains with AT-HH tug walkers."
  },
  {
    "name": "   Baze Malbus' MWC-35c Repeating Cannon  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/mwc-35c-repeating-cannon-main_46aa5a0e.jpeg?region=341%2C0%2C878%2C878",
    "detail": "Baze Malbus has abandoned the ancient ways of the Guardians of the Whills, taking up an inelegant weapon for a less civilized age. His “Staccato Lightning” repeating cannon uses a belt of galven circuitry and a refrigerant tank to deliver the equivalent of five laser rifles’ worth of destructive firepower, making Baze a one-man wrecking crew in battle and an agent of retribution for the Empire’s evils."
  },
  {
    "name": "   Ben Kenobi’s secret lightsaber box   ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/ben-kenobi-s-secret-lightsaber-box-main_84b84b66.jpeg?region=213%2C0%2C854%2C854",
    "detail": "Buried in the sands of Tatooine, the man once known as Obi-Wan Kenobi has hidden his most precious possessions in an effort to mask his true identity from Jedi hunters. Inside, two lightsabers have been laid to rest. One was Kenobi's during his time as a Jedi Master; the other belonged to his apprentice, Anakin Skywalker, before his fall to the dark side. "
  },
  {
    "name": "   Beskar spear  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/beskar-spear_064ab4c6.jpeg?region=438%2C0%2C538%2C536",
    "detail": "Formerly wielded by Magistrate Morgan Elsbeth, a beskar spear rings with distilled purity when struck against other beskar. Not only can it withstand lightsaber blows; it is capable of piercing Mandalorian armor. "
  },
  {
    "name": "   Blade of Ochi of Bestoon   ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/blade-of-ochi-of-bestoon-main_648f1e36.jpeg?region=82%2C0%2C854%2C854",
    "detail": "This ornate knife, once owned by Ochi of Bestoon, sends a shock through Rey when she touches it, as the evil deeds committed with it still resonate in the Force. Sith runes carved on the blade reveal the location of the Emperor’s lost Sith wayfinder – but C-3PO’s programming forbids him from translating them. Unlocking the ominous weapon’s mysteries will lead Rey to a fateful discovery about her own origins. "
  },
  {
    "name": "   BlasTech A280-CFE  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/blastech-a280-cfe-main_c870987e.jpeg?region=341%2C0%2C878%2C878",
    "detail": "Cassian Andor is an experienced soldier and a well-trained sniper, and uses a weapon that allows him to switch missions as events demand. His A280-CFE (covert field edition) pistol can be augmented with an extended barrel, stock and sight, turning the sidearm into a rifle ideal for eliminating targets at long range."
  },
  {
    "name": "   Blaster Pistol  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/image_75ccd60e.jpeg?region=395%2C0%2C878%2C878",
    "detail": "The standard ranged weapon of both military personnel and civilians in the galaxy, the blaster pistol fires cohesive bursts of light-based energy called bolts. Appearing in a variety of shapes and sizes and sometimes augmented for other functions, including acension guns that fire grappling hooks, blaster pistols deliver a wide range of damage capability. Many blaster pistols have stun settings that incapacitate a target, rather than inflicting physical damage. While blasters do deliver a searing concussive blast, they can be foiled by magnetic seals and deflector shields."
  },
  {
    "name": "   Blaster Rifle  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/image_2702e35a.jpeg?region=387%2C0%2C878%2C878",
    "detail": "Larger, more powerful blasters, often used by Stormtroopers, clones, or bountry hunters. Other forms included sniper blaster rifles."
  },
  {
    "name": "   Blue Shadow Virus  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/image_1ff7b9aa.jpeg?region=558%2C0%2C877%2C878",
    "detail": "This deadly waterborne virus was considered extinct by the time of the Clone Wars, but the Separatist researcher Nuvo Vindi re-engineered it, adapting it to spread through air instead of water. Vindi considered the virus a perfect organism, and imagined a galaxy where it was the only living thing, having killed everything else. He worked to release the virus on Naboo, but was foiled by clones led by Padmé Amidala and Ahsoka Tano."
  },
  {
    "name": "   Bokken sabers  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/bokken-sabers-mian_92a28b70.jpeg?region=193%2C1%2C807%2C803",
    "detail": "For generations, the Jedi Order employed a variety of training instruments to prepare younglings and Padawans for lightsaber defense. Bokken sabers, lightweight wooden facsimiles similar in shape to the kyber-powered weapon of the Jedi, are tools for safely sparring without the danger of losing a hand."
  },
  {
    "name": "   Bowcaster  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/databank_bowcaster_01_169_475a4a3b.jpeg?region=246%2C0%2C878%2C878",
    "detail": "A traditional Wookiee weapon, bowcasters are hand-crafted on Kashyyyk according to ancient methods. Bowcasters are more powerful and accurate than blasters, firing a metal quarrel encased in plasma energy. Like many Wookiee creations, the bowcaster combines traditional craftsmanship with galactic technology. Noted bowcaster wielders include Chewbacca and the bounty hunter Embo."
  },
  {
    "name": "   camtono case  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/camtono-case-main_cc7de4f3.jpeg?region=149%2C92%2C444%2C444",
    "detail": "Cylindrical in shape, but small enough to be tucked under the average humanoid's arm, a camtono case can be used to hold a variety of treasures, including ingots of beskar steel or a wealth of rare spice. At a moment's notice, it's small enough to be snatched up for a hasty escape."
  },
  {
    "name": "   Captain Phasma's Baton  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/captain-phasmas-baton-db-tlj_4e47c742.jpeg?region=53%2C0%2C720%2C720",
    "detail": "For close-quarters combat, Captain Phasma carries a quicksilver baton compacted within a containment field. Activating the baton causes it to extend to full length, boasting spearpoints at either end."
  },
  {
    "name": "   Captain Phasma's Blaster Rifle   ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/phasmas-blaster-rifle_59308fd3.jpeg?region=140%2C0%2C987%2C988",
    "detail": "While performing her duties for the First Order, Captain Phasma carries a customized blaster rifle, clad in chromium to match her distinctive armor. Phasma’s rifle lacks the full trigger guard standard for an F-11D blaster."
  },
  {
    "name": "   Carbon-freezing  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/carbon-freezing-main-image_92b3d8cd.jpeg?region=237%2C0%2C1022%2C1025",
    "detail": "Carbon-freezing is an industrial process that encases highly pressurized gases inside solidified carbonite. In Cloud City, Darth Vader decided to freeze Luke Skywalker in carbonite for transport to the Emperor. (As Anakin Skywalker, he’d undergone the process himself to evade Separatist life detectors.) Before setting his trap for Luke, Vader tested the process on Han Solo. The smuggler survived, and was later freed by Princess Leia in Jabba’s palace, though hibernation sickness left him temporarily blind."
  },
  {
    "name": "   Cardo’s arm cannon  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/cardos-arm-cannon-main_c7c31a27.jpeg?region=282%2C0%2C720%2C720",
    "detail": "This customized weapon makes Cardo a walking arsenal, combining a wide-bore flamethrower with a repeating laser cannon that can also launch plasma bolts. It’s the perfect weapon for its bearer, who likes nothing better than to unleash destruction against all enemies in range."
  },
  {
    "name": "   Chain Code  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/chain-code-main_b74a2e82.jpeg?region=231%2C33%2C489%2C489",
    "detail": "At the dawn of the Empire, galactic citizens willingly submitted to a form of tracking, registering for individual chain codes in exchange for new Imperial credits to spend in the freshly-formed autocracy. In quick succession, such forms of identification made it nearly impossible to travel from planet to planet without it, but could be forged by someone with enough technical skill and the right data disks."
  },
  {
    "name": "   Chirrut Îmwe's Lightbow  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/chirruts-lightbow-main_c16a4131.jpeg?region=333%2C0%2C878%2C878",
    "detail": "Before the Empire left their traditions in ruins, a Guardian of the Whills constructed a lightbow as part of his or her spiritual progression. A lightbow is similar to the bowcasters built by Kashyyyk’s Wookiees, marrying handcrafted artisanry with technology to create a weapon more powerful than a heavy rifle. Chirrut Îmwe uses his lightbow to devastating effect on Eadu and Scarif."
  },
  {
    "name": "   Chirrut Îmwe's Staff  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/chirruts-staff-main_3f1fb429.jpeg?region=244%2C0%2C877%2C878",
    "detail": "Chirrut Îmwe carries a flame-hardened staff of uneti-wood while afoot in Jedha’s Holy City. The staff appears to be nothing more than a blind man’s walking stick, but it is a deadly weapon in Chirrut’s hands. One end is capped with an enclosure for a kyber crystal, offering a symbolic source of inner illumination."
  },
  {
    "name": "   Clone Trooper Armor  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/clone-trooper-armor_607fbd6a.jpeg?region=181%2C54%2C613%2C613",
    "detail": "The secret army created by the Kaminoans came outfitted with armor, weapons and gear. Each clone trooper wore a set of form-fitting plastoid plates over a black body glove. While not proof against a direct hit from a laser blast, clone armor could withstand impacts, pressure, heat and acrid vapors. Improvements were made throughout the Clone Wars, and armor variants were introduced for specialized missions."
  },
  {
    "name": "   Comlink  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/image_882c5d68.jpeg?region=894%2C55%2C714%2C713",
    "detail": "Comlinks are standard handheld communication devices, fit with microphones and receivers, and are prevalent throughout the galaxy. The Empire used the standard C1 personal comlink, manufactured by the SoroSuub Corporation. For private transmissions, comlinks can be tuned with encryption algorithms to work only with each other."
  },
  {
    "name": "   Communications Transmitter  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/communications-transmitter_e7ec198d.jpeg?region=420%2C0%2C1080%2C1080",
    "detail": "Often outfitted to larger vehicles like an ore crawler, a communications transmitter is a significant signal booster. More powerful communications transmitters can support communique over light-year distances."
  },
  {
    "name": "   Construction spheres  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/construction-spheres_d49ad29a.jpeg?region=423%2C0%2C1080%2C1080",
    "detail": "Construction spheres are utilized by the Empire throughout the galaxy as depots for building materials. These giant round bases orbit planets where they can support Imperial development."
  },
  {
    "name": "   Count Dooku's Lightsaber  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/dookus-lightsaber-1-1_4daacef9.jpeg?region=0%2C0%2C1000%2C1000",
    "detail": "Count Dooku’s red-bladed lightsaber was an elegant weapon befitting a refined man. Its gracefully curved hilt let Dooku slash and lunge with greater precision. Dooku defeated Obi-Wan Kenobi and Anakin Skywalker in a lightsaber duel on Geonosis before being bested by Yoda. He fought Obi-Wan and Anakin again during the Clone Wars, as well as his former apprentices Asajj Ventress and Savage Opress, before dying in a final confrontation with Anakin."
  },
  {
    "name": "   Cubikahd  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/cubikahd_f527f92a.jpeg?region=428%2C160%2C718%2C718",
    "detail": "Cubikahd (rendered \"cu'bikad\" in some dialects) was a holographic Mandolorian strategy game with a cube-shaped board and gridlines. Each player had four “knives” to move on the surface, strategically placed until their opponent’s pieces were captured."
  },
  {
    "name": "   D-93 Incinerator Flamethrower  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/d-93-incinerator-flamethrower_207d47a3.jpeg?region=696%2C0%2C634%2C636",
    "detail": "Incendiary weapons have a long history in the galaxy, and are used to flush enemies from cover and destroy objects and structures that could be used as shelter. The D-93 incinerator combines three fuel tanks worn as a backpack with a flame-projector gun, connected to the backpack rig by a reinforced hose. Two of the tanks contain a volatile, flammable gel known as conflagrine-14, while the third is filled with propellant gas that launches the gel through the hoses. This combination is mixed and ignited at the barrelhead of the weapon, which has an effective range of 75 meters."
  },
  {
    "name": "   Darksaber  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/emily-swallow-interview-f_6148b414.jpeg?region=274%2C53%2C800%2C800",
    "detail": "An ancient lightsaber that serves as a powerful symbol of leadership to the Mandalorians, the Darksaber is a unique weapon with a black-energy blade lined with a crackling white edge."
  },
  {
    "name": "   Darth Maul's Lightsaber  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/darth-mauls-lightsaber-1-1_f3b22650.jpeg?region=0%2C0%2C1000%2C1000",
    "detail": "The Sith apprentice Darth Maul wielded a double-bladed lightsaber made by joining two hilts together end-to-end. Maul’s dexterity and extensive training allowed him to use his weapon as a single-bladed saber, or to activate both crimson blades and fight multiple opponents at once. On Naboo, Maul killed Qui-Gon Jinn with his saber, but Obi-Wan Kenobi cut his weapon in half and soon did the same to Maul. Unknown to Obi-Wan, Maul survived, and retained the working half of his weapon. He used this single-bladed saber while leading the Shadow Collective."
  },
  {
    "name": "   Darth Vader's lightsaber  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/vaders-lightsaber-1-1_ee8addde.jpeg?region=0%2C0%2C1000%2C1000",
    "detail": "After pledging himself to the Sith Lord Darth Sidious, Anakin Skywalker took the name Darth Vader but continued to use the blue-bladed lightsaber he’d fought with during the Clone Wars. He lost this weapon on Mustafar and constructed a replacement with the crimson blade favored by the Sith. Vader used his Sith lightsaber rarely but to deadly effect, as enemies of the Empire discovered."
  },
  {
    "name": "   Datapad  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/solo-db-datapad-main-image_242966d0.jpeg?region=526%2C0%2C878%2C878",
    "detail": "Datapads are used for a variety of informational purposes. Most feature a screen, input mechanism, and can store or display holographic data and imagery."
  },
  {
    "name": "   Datarod  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/datarod-main_b2f229c8.jpeg?region=433%2C0%2C543%2C542",
    "detail": "Datarods are a necessity for anyone looking to transmit technical readouts or store large caches from a droid's databank. During a mission to infiltrate a droid decommissioning facility, Clone Force 99's Tech uses a datarod to download intelligence from a Separatist tactical droid, databanks that are key in the fight against the Empire."
  },
  {
    "name": "   DC-17 blaster  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/dc-17-blaster-main_eb4167a8.jpeg?region=542%2C0%2C542%2C542",
    "detail": "Elite soldiers in the Republic's grand army were known to carry DC-17 blasters in pairs. Among the most notable adopters were Hunter and Echo in Clone Force 99, as well as standard ARC troopers, clone commanders, and even jet troopers."
  },
  {
    "name": "   Death Star Plans  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/death-star-plans-main_1225d91c.jpeg?region=341%2C0%2C878%2C878",
    "detail": "The plans for the Empire’s ultimate weapon reside in a electromagnetic cartridge in the Structural Engineering node of the Scarif vault’s datatree. The plans contain the Death Star’s entire design history, including the flaw introduced into its reactor system. Stolen by Jyn Erso, they are beamed to the Profundity, copied and hidden in the memory systems of a humble astromech droid."
  },
  {
    "name": "   Death Star Superlaser  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/death-star-super-laser-main-image_408bebb4.jpeg?region=618%2C0%2C655%2C656",
    "detail": "Each of the Empire’s Death Stars was built around a terrifying weapon – a superlaser array capable of destroying a planet. According to legend, the ancient Sith used massive kyber crystals to create superweapons; during the Clone Wars, the Geonosians revived the superlaser design. The Empire constructed the first Death Star in secret for nearly two decades before using it to destroy Alderaan; the second Death Star boasted a more powerful superlaser, with improved targeting sensors and power regulators."
  },
  {
    "name": "   Death Sticks  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/death-sticks_7c313ec9.jpeg?region=144%2C0%2C1182%2C1182",
    "detail": "These illicit drugs were readily available in the underworld of Coruscant and elsewhere across the galaxy. This highly addictive substance, delivered inside luminescent sticks, was a favorite among desperate addicts and foolish thrill-seekers. One dealer on Coruscant, Elan Sleazebaggano, once tried selling Jedi Knight Obi-Wan Kenobi death sticks inside the Outlander Club."
  },
  {
    "name": "   Death Trooper BlasTech E-11D Rifle  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/blastech-e-11d-main_907dd2a9.jpeg?region=647%2C0%2C878%2C878",
    "detail": "A variant of the standard E-11 rifle used by the Stormtrooper Corps, the E-11D boasts a stock and a large-bore reinforced rifle to maximize the weapon’s intensity and rate of fire. The Empire’s elite death troopers use these rifles on a number of missions."
  },
  {
    "name": "   Dejarik  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/the-bad-batch-common-ground-story-gallery-14_cf875f28.jpeg?region=369%2C0%2C542%2C542",
    "detail": "Dejarik was a popular holographic board game, commonly played on on starships and homes throughout the galaxy from well before the time of the Clone Wars and long through the era of the Empire. A great way to pass the time on long hyperspace trips, the game pieces in dejarik were creatures both real and mythological and a successful move would result in one monster decisively beating another in holo-animated combat. Though dejarik was a friendly game played by droids, humans, clones, and aliens alike, Wookiees were particularly notorious for becoming rather upset upon losing."
  },
  {
    "name": "   DG-29 heavy blaster pistol  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/solo-db-dg-29-blaster-main-image_f4e604c0.jpeg?region=756%2C27%2C785%2C786",
    "detail": "Tobias Beckett is a capable fighter who often draws blasters in both hands. His chosen weapon for his dominant left hand is a DG-29 sideloader heavy blaster pistol, manufactured by BlasTech and sporting an image-intensifying macroscope for long-range shots."
  },
  {
    "name": "   DL-18 Blaster Pistol  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/dl-18-blaster-pistol_5b86cff8.jpeg?region=247%2C0%2C1067%2C1067",
    "detail": "These compact blaster pistols were favored by elements of the underworld, particularly those based on Tatooine. In the early days of the Galactic Civil War, former Jedi Kanan Jarrus carried one, using it far more often than his secret lightsaber. Later in the war, DL-18s were in wide distribution inside Jabba’s Palace in the last days of his life. Luke Skywalker used the Force to snatch one from one of Jabba’s men, just before he fell into the rancor pit below Jabba’s throne."
  },
  {
    "name": "   DL-44 Blaster Pistol  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/dl-44-blaster-pistol_6f44d72b.jpeg?region=255%2C0%2C1050%2C1050",
    "detail": "DL-44s were accurate, highly reliable, and easily modifiable, which made them a go-to weapon for military personnel, bounty hunters, and smugglers. Perhaps the most infamous user of a modified DL-44 was the smuggler-turned-hero-of-the-Rebellion, Han Solo. DL-44s were capable of firing charges powerful enough to blow through Stormtrooper armor."
  },
  {
    "name": "   DLT-19 Heavy Blaster Rifle  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/dlt-19-heavy-blaster-rifle_60a77bd6.jpeg?region=587%2C0%2C973%2C971",
    "detail": "These heavy blaster rifles were carried by stormtroopers when they needed more firepower in the field. Bounty hunters also favored them for sniping jobs. Their durability made them ideal for use on far flung outposts in inhospitable environments like Tatooine. They were equipped with bipods for steadier shooting as well as a folding stock."
  },
  {
    "name": "   Droid Popper  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/databank_droidpopper_01_169_b5ada6cc.jpeg?region=748%2C0%2C798%2C799",
    "detail": "Also called an Electro Magnetic Pulse grenade, or EMP grenade, these were used by Jedi and clones in the Clone Wars. When detonated close to a droid, it would disable it. Effectiveness depended on distance and placement relative to the target."
  },
  {
    "name": "   Droid remote control  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/droid-remote-control_8b16f118.jpeg?region=274%2C0%2C877%2C877",
    "detail": "A small, palm-sized device, the droid remote control was used to power large numbers of droids on and off at the same time. When the pirate Hondo Ohnaka stole the Broken Horn from Cikatro Vizago, he used a droid remote control to deactivate all on-board droids, ensuring an easy take over."
  },
  {
    "name": "   E-10 blaster rifle  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/solo-db-e-10r-main-image-square_a997b44c.jpeg?region=0%2C0%2C878%2C878",
    "detail": "Manufactured by BlasTech, the E-10 is a forerunner of the E-11 rifle. Mimban’s mudtroopers are eager for the E-10 to be phased out, complaining that it has a habit of jamming at the worst possible moment. A variant used by range troopers, the E-10R, offers enhanced electroscope optics, and an extended stock that can house extra ammunition."
  },
  {
    "name": "   E-11 Blaster Rifle  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/e-11-blaster-rifle_c6d03948.jpeg?region=354%2C0%2C1054%2C1051",
    "detail": "BlasTech’s E-11 Blaster Rifle was the weapon of choice and standard issue for the Stormtroopers of the Galactic Empire. With telescopic sights, adjustable stocks, and a high powered, red colored plasma blast, these weapons were the perfect killing machines for the Empire. They were equally deadly in the hands of the Rebellion at times when they managed to steal them from the Empire, as Princess Leia Organa did to aid in her escape from Cloud City."
  },
  {
    "name": "   E-22 blaster rifle  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/solo-db-e-22-main-image_17d926a7.jpeg?region=341%2C0%2C878%2C878",
    "detail": "A reciprocating double-barreled blaster rifle, the E-22’s heavy firepower is a must in pitched fights, and used to devastating effect by the Imperial Army on planets such as Mimban. Mudtroopers battling the native Mimbanese discovered it was vital to keep the recoil sleeve free of mud, for fear of a jam at the worst possible moment."
  },
  {
    "name": "   EC-17 hold-out blaster  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/solo-db-ec-17-main-image_31adebae.jpeg?region=276%2C0%2C878%2C878",
    "detail": "A compact blaster favored by the Empire’s scout troopers and patrol troopers, the EC-17 has a pressure-sensitive grip that makes it easier to fire while wearing thick gloves. A lightweight sidearm, it’s most effective in short-range combat."
  },
  {
    "name": "   electro-bisento  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/last-jedi-databank-electro-bisento-main-image_92e892cf.jpeg?region=324%2C0%2C720%2C720",
    "detail": "Two of Supreme Leader Snoke’s Praetorian Guards are armed with electro-bisentos, polearms with scythelike blades. As with all the Praetorians’ weapons, the electro-bisento is a technological refinement of an ancient melee weapon."
  },
  {
    "name": "   electro-chain whip  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/last-jedi-databank-electro-chain-whip-main-image_93f664c4.jpeg?region=222%2C0%2C720%2C720",
    "detail": "The Bilari electro-chain whip is a weapon used by two of Snoke’s Praetorian Guards to defend the Supreme Leader. An electro-plasma filament is threaded through the whip’s articulated segments, packing enough power to kill an opponent. The whip can be stiffened to act like a bludgeon in combat."
  },
  {
    "name": "   Electro-shock prod  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/ep8-132217_r_6a2c1942.jpeg?region=280%2C0%2C720%2C720",
    "detail": "A handheld device, an electro-shock prod delivers a burst of electrical energy that can stun an organic being the size of a Wookiee. With morale suffering aboard the Resistance flagship Raddus, Rose Tico is given a prod and ordered to neutralize anyone trying to make a getaway in the heavy cruiser’s escape pods."
  },
  {
    "name": "   Electro-Whip  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/02330_cw404_cf_rda060_214_15771_dd3db9ac.jpeg?region=449%2C0%2C663%2C663",
    "detail": "These electrified whips were the preferred method of domination for the subjugation of slaves taken by Zygerrians. They consisted of a metal grip and an electrified wire that glowed when powered up. They were incredibly painful, but not typically physically damaging, as Zygerrians didn’t want to damage their merchandise irreparably."
  },
  {
    "name": "   electroripper staff  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/solo-db-electroripper-main-image_1f11dab8.jpeg?region=341%2C0%2C878%2C878",
    "detail": "Enfys Nest prefers melee weapons to blasters, and no weapon is more fearsome than the raider’s electroripper staff. This weighted polearm is tipped with a glowing ribbon of energy powerful enough to rip through metal or incapacitate an opponent."
  },
  {
    "name": "   Electrostaff  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/databank_electrostaff_01_169_16d9e207.jpeg?region=5%2C0%2C878%2C878",
    "detail": "These mechanically complicated, double-ended electrostaffs were designed to repel lightsaber strikes. They conducted electricity that could block the Jedi blades and were able to incapacitate organic beings of most physiologies. They were the chief weapon of the Magnaguards that protected General Grievous during his terrorization of the galaxy during the Clone Wars. Electrostaffs were also used as a tool for catching joopa beneath the surface of the planet Seelos by sending bolts of energy along a laser line."
  },
  {
    "name": "   Energy Ball (Booma)  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/energy-ball-booma_9d96f2ae.jpeg?region=255%2C0%2C698%2C701",
    "detail": "Boomas were spherical, grenade-type weapons colored pink and purple that were used exclusively by the Gungan Grand Army. Inside each energy ball was a plasma-like substance harvested deep inside the crust of Naboo’s surface that would short out electronic equipment and droids, in addition to delivering great shocks to organic beings. They came in various sizes and could be launched by hand, sling, or even catapult."
  },
  {
    "name": "   Energy bow  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/the-bad-batch-decommissioned-story-gallery-01_d28beb25.jpeg?region=369%2C0%2C542%2C542",
    "detail": "Firing sizzling laser bolts instead of arrows, a Zygerrian energy bow is a formidable weapon in a firefight if you have a sharp eye and strong arms to lend the weapon unwavering accuracy. Clone Force 99's Omega recovered an energy bow on a mission to Ord Mantell, but the young girl soon found she would need practice and physical strength to become skilled with it."
  },
  {
    "name": "   Ezra's Lightsaber  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/ezra_s-lightsaber-new_1c682dc3.jpeg?region=295%2C0%2C878%2C878",
    "detail": "His original lightsaber destroyed by Darth Vader on Malachor, Ezra built a new Jedi weapon. Ezra’s new lightsaber featured a hilt with a black grip and silver accents, along with a green blade."
  },
  {
    "name": "   First Order data-medallion  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/first-order-medallion-main_8a5ee77d.jpeg?region=678%2C38%2C480%2C480",
    "detail": "First Order officers use data-medallions to verify their identities while traveling, with the devices transmitting encrypted codes. Such verifications help cut through bureaucratic snarls and maintain secrecy during covert operations. Zorii Bliss gives Poe Dameron a captain’s data-medallion to help him rescue Chewbacca from captivity above Kijimi."
  },
  {
    "name": "   Flame cannons  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/the-bad-batch-season-2-ep-6-story-gallery-14_e918ff7a.jpeg?region=950%2C0%2C813%2C813",
    "detail": "Trandoshan hunter Babwa Venomor has many weapons in his arsenal, including the clone soldiers of the Empire. But he prefers to stalk his prey alone, using a flame cannon to burn through the forests of Kashyyyk in pursuit of one special Wookiee."
  },
  {
    "name": "   flash charge  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/flash-charge-main_819dc187.jpeg?region=404%2C1%2C536%2C535",
    "detail": "Flash charges are a part of the Mandalorian's arsenal, a simple tool of the trade that can blind an enemy's scope temporarily to avoid getting picked off by a deadly sniper."
  },
  {
    "name": "   Flight data recorder  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/flight-data-recorder_4dc1d205.jpeg?region=276%2C0%2C878%2C878",
    "detail": "A flight data recorder is present on nearly every space-faring ship in the galaxy. It contains complete records of a craft's range, top speed, shield array, weapons payload, and more."
  },
  {
    "name": "   Flight Simulator Squadron  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/resistance-db-flight-simulator-squadron-main-image_b92b88a4.jpeg?region=358%2C0%2C878%2C878",
    "detail": "Grounded in her room in her father's attempt to protect her from the First Order, Torra Doza keeps herself entertained, bobbing and weaving to control the small computer-generated ship in her holo-game, Flight Simulator Squadron. Although an enjoyable past time, especially playing with friends, what the ace pilot really craves is some fresh air and the chance to really fly. "
  },
  {
    "name": "   Force Choke  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/databank_forcechoke_01_169_93e4b0cf.jpeg?region=168%2C0%2C877%2C878",
    "detail": "The Force choke is another tool employed by Sith to intimidate and even kill their opponents. Sith usually visualize the ability with a claw-like or crushing hand gesture, and strangle a victim through the power of the dark side. The result is an often painful, slow death."
  },
  {
    "name": "   Force Lightning  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/databank_forcelightning_01_169_b1eb5a6f.jpeg?region=460%2C0%2C878%2C878",
    "detail": "Force lightning is a dark side ability used to torture, disfigure, and even kill one’s victims. Blue in color, Sith shoot Force lightning from their hands by calling on their hatred and aggressive feelings. However, while a deadly weapon, it is not unstoppable. Force lightning can be deflected and absorbed by a lightsaber, and select Jedi have proved able to neutralize the technique through the power of the light side."
  },
  {
    "name": "   Force Push  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/databank_forcepush_01_169_645aafe8.jpeg?region=138%2C0%2C878%2C878",
    "detail": "A key Force ability, the Force push is both an offensive and defensive technique. It is employed primarily by Jedi but also used by the Sith, and is accomplished with a forward hand gesture. Force pushes can range in intensity from simple movements to dangerous, powerful shoves that can disorient and harm opponents in battle."
  },
  {
    "name": "   Gaderffii Stick  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/gaderffii-stick-main_6166d541.jpeg?region=147%2C0%2C853%2C853",
    "detail": "Also known as a Gaffi Stick, these were the spiked pole arms traditionally wielded by the tribes of Tusken Raiders that were indigenous to Tatooine. Each was unique as they were built with scrounged materials, but were useful as mace-like clubs and for stabbing."
  },
  {
    "name": "   Geonosian Sonic Blaster  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/geonosian-sonic-blaster_0a8ad48d.jpeg?region=396%2C0%2C878%2C878",
    "detail": "Geonosians were gifted engineers, and that cultural trait extended to weaponry. The Geonosian sonic blaster was a powerful rifle-style blaster, but fired rings of energy. Depending on the setting, the blast could stun or kill."
  },
  {
    "name": "   GLIE-44 blaster pistol  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/glie-4-blaster-pistol-main_1f7975da.jpeg?region=242%2C0%2C516%2C516",
    "detail": "A compact blaster pistol that still packs a punch, the GLIE-44 has become a favorite of Resistance pilots and leaders in need of a reliable sidearm in their struggle against the First Order.  "
  },
  {
    "name": "   grapple gun  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/solo-db-gapple-gun_09a87ca0.jpeg?region=247%2C0%2C878%2C878",
    "detail": "Val is athletic and unafraid of heights, using her grapple gun – a modified net-thrower originally used for hunting – to let her cross gaps. The gun fires a rocket piton attached to a spool of compressed syntherope housed in a top-mounted reel assembly. This customized gun’s range exceeds 600 meters."
  },
  {
    "name": "   grapple line  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/grapple-line-main_92f159e7.jpeg?region=300%2C0%2C538%2C536",
    "detail": "Among the Mandalorian's tools of the trade, a grapple line makes an essential tether to prevent a fatal fall or corral an enemy."
  },
  {
    "name": "   Gravity lock  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/gravity-locks_0f650e6c.jpeg?region=458%2C0%2C877%2C878",
    "detail": "Developed by the Empire, a gravity lock uses tractor beam technology that prevents a starship from taking off. The hovering devices clamp down onto a ship’s landing gear, are near-impossible to destroy, and cannot be forcibly removed; they can only be dismantled, which would require knowledge of their inner workings."
  },
  {
    "name": "   gription boots  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/solo-db-gripton-boots-main-image_5a07e834.jpeg?region=355%2C0%2C878%2C878",
    "detail": "Range troopers assigned to conveyex security duty on Vandor wear heavy-duty magnetized gription boots. These boots allow them to inspect the train while it races along the track, making twists and turns to avoid obstacles. Interface controls for the boots are typically located on the trooper’s vambrace armor plate."
  },
  {
    "name": "   Gungan Personal Energy Shield  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/databank_gunganpersonalenergyshield_01_169_78606583.jpeg?region=341%2C0%2C878%2C878",
    "detail": "Protective shields featuring a screen of energy that could be turned on or off. Deflects blaster fire and can protect against solid weaponry."
  },
  {
    "name": "   GX-8 Condenser Unit  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/gx8-condenser-unit-main_cf59236f.jpeg?region=414%2C0%2C878%2C878",
    "detail": "Lah’mu has abundant water, but tephra ejected by the planet’s volcanoes contains minerals that make its groundwater unpleasant to drink. The Erso homestead uses GX-8 condenser units manufactured by Pretormin Environmental to distill water vapor from the air and store it for later use."
  },
  {
    "name": "   History of the Galaxy  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/history-of-the-galaxy-main_7aa05c0f.jpeg?region=627%2C0%2C806%2C803",
    "detail": "Deep in Professor Huyang’s databanks, the ancient droid retains much knowledge that served him over millennia with the Jedi Order. Included in these records is a detailed blueprint of every lightsaber constructed under his tutelage and the three-volume set, History of the Galaxy. The stories, which he once used to entertain the younglings at the Jedi Temple, tell of the “Pathway to Peridea” and other tales."
  },
  {
    "name": "   Holographic Disguise Matrix  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/databank_holographicdisguisematrix_01_169_14f47b84.jpeg?region=341%2C0%2C878%2C878",
    "detail": "Developed by the technical genius Sinrich, the holographic disguise matrix is an experimental example of advanced holography. Contained within a small, palm-sized emitter, the disguise matrix -- also known as the shadow hologram -- cloaks a user in an exacting, true-color holographic shell. Disparities between subject build and height are compensated for by advanced sensors that holographically \"paint in\" any differences. Combined with vocal emulators and other sensor-baffling gear, the shadow hologram emitter is the ideal infiltration tool -- or would be, if its shortcomings in power supply and image consistency could be smoothed out."
  },
  {
    "name": "   HoloNet News  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/image_4e0f58f4.jpeg?region=363%2C0%2C1080%2C1080",
    "detail": "HoloNet News was the official state-sanctioned news agency of the Empire, with anchor Alton Kastle delivering broadcasts on key issues and occurrences of the day. Briefs were sent via hyperspace transmission that allowed instantaneous connection throughout the galaxy. The HoloNet News was taken over by the Republic during the Clone Wars to ensure that information was not compromised by enemy forces, and became the mouthpiece of the Empire. The Ministry of Information's Pollux Hax oversaw the agency, ensuring that stories were consistent with government messaging."
  },
  {
    "name": "   holopuck  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/holopuck-main_950e63ec.jpeg?region=449%2C0%2C535%2C536",
    "detail": "The Bounty Hunters Guild identifies quarries through simple holopucks. With the aid of this intel and a tracking fob, their quarries will be hunted to the edge of the galaxy."
  },
  {
    "name": "   Homing Beacon  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/tlj-screenshot-homing-beacon-5_c2927f5f.jpeg?region=683%2C0%2C877%2C878",
    "detail": "Homing beacons are sophisticated yet compact devices that transmit a hyperwave signal which can be detected thousands of light-years away. Knowing that the Resistance will soon be on the move, Leia Organa gives Rey a cloaked transmitter bracelet, keeping its mate on her own wrist. This will allow Rey to locate the Resistance fleet once she finds Luke Skywalker."
  },
  {
    "name": "   Homing Spider Droid  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/homing-spider-droid-main-image_0cf45312.jpeg?region=460%2C0%2C667%2C665",
    "detail": "Homing spider droids' long mechanical legs and dish-shaped laser cannons gave them an imposing mix of speed and destructive power, which they used to devastating effect against Republic ground forces during the Battle of Geonosis."
  },
  {
    "name": "   hovering pram  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/hovering-pram-main_427c1e7e.jpeg?region=336%2C0%2C537%2C536",
    "detail": "A hovering pram serves many functions. Whether shielding a youngster with a special screen, protecting it from prying eyes and the atrocities of the world beyond, or coasting peacefully to the next destination, the device is a valuable tool for guardians with children too young to protect themselves."
  },
  {
    "name": "   Hydroid Medusa  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/databank_hydroidmedusa_01_169_c8978f0a.jpeg?region=341%2C0%2C878%2C878",
    "detail": "Beautiful and dangerous at the same time, the Hydroid Medusa is a cybernetically enhanced biological weapon developed by the Karkarodons of Karkaris. These immense jellyfish incorporate armor and powerplants that turn them into near-unstoppable engines of underwater destruction. Separatist landing ships airdropped many Hydroid Medusas into the Mon Cala oceans during the Clone Wars, giving the Separatists the advantage in the civil war that erupted on the water world."
  },
  {
    "name": "   Hyperdrive  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/hyperdrive_068c25c9.jpeg?region=274%2C0%2C666%2C667",
    "detail": "Hyperdrives allow starships to travel faster than the speed of light, crossing space through the alternate dimension of hyperspace. Large objects in normal space cast “mass shadows” in hyperspace, so hyperspace jumps must be precisely calculated to avoid collisions."
  },
  {
    "name": "   Imperial Construction Module  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/imperial-construction-module_8b1022ca.jpeg?region=431%2C0%2C877%2C878",
    "detail": "Imperial construction modules were large-scale space bases used during building projects. They housed all materials, plans, and data related to development. An Imperial construction module orbiting Geonosis was discovered by the rebels, and the Ghost crew went on mission to investigate. This module, however, while once active, was nothing more than a backdrop for an Imperial trap."
  },
  {
    "name": "   Imperial minefield  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/imperial-minefield-main_fbf98e6c.jpeg?region=558%2C0%2C804%2C804",
    "detail": "Deployed as the first line of defense around proprietary locations, an Imperial minefield can be placed at a hyperspace arrival point to bombard unwanted visitors and alert denizens to their arrival. "
  },
  {
    "name": "   Imperial N-S9 Starpath Unit  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/imperial-ns9-starpath-unit-main_3be2860b.jpeg?region=558%2C0%2C804%2C804",
    "detail": "A highly valuable piece of restricted Imperial technology, an N-S9 Starpath Unit uses proprietary Imperial signals and frequencies to coordinate and map the relation of a starship to every Imperial asset -- installation or vessel -- within nine radial parsecs."
  },
  {
    "name": "   Imperial XX-23 S-Thread Tracer  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/image_d1209d71.jpeg?region=603%2C127%2C824%2C823",
    "detail": "Developed by Sienar Fleet Systems for the Empire, the Imperial XX-23 S-Thread Tracer was made specifically to track ships through hyperspace to destination. It was housed in a missle-like shell, allowing the XX-23 S-Thread to be fired at craft from long distances or during chases. The Inquisitor's TIE Advanced fighter was outfitted with the technology, which he used to tag the Ghost starship."
  },
  {
    "name": "   Inhibitor chip  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/inhibitor-chip-main_23d31b61.jpeg?region=467%2C0%2C537%2C538",
    "detail": "Clone soldiers in the Grand Army of the Republic were engineered with a special inhibitor chip to help ensure they could be controlled. Although there were reports of some defective chips causing clones to act erratically during the Clone War, the device was vital to the execution of Order 66, which brought about the end of the Jedi Order. Only a handful of clone troopers, including the members of Clone Force 99, seemed to be unaffected."
  },
  {
    "name": "   Interrogation Chair  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/interrogation-chair_700fdd16.jpeg?region=322%2C235%2C417%2C417",
    "detail": "The enemies of the Empire feared interrogation at the hands of the Imperial Security Bureau and the Inquisitors, and the First Order has continued this brutal tradition, crafting interrogation chairs to restrain captives and inflict pain on them via the chairs’ built-in probes and tools. Interrogators often do their hideous work with the assistance of torture droids."
  },
  {
    "name": "   Ion Blaster  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/ion-blaster_62b30531.jpeg?region=459%2C0%2C1037%2C1034",
    "detail": "While hunting for salvage, Tatooine’s Jawas carry customized ion blasters built from scavenged parts. The weapons fire blasts of ionized particles, which disrupt droids’ electronic systems, shutting them down. Ion weapons are a long-established galactic technology, and come in a range of sizes and power levels – massive planet-based ion cannons target orbiting warships instead of droids, but work on the same principle."
  },
  {
    "name": "   Ion Cannon  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/ion-cannon_af46d6df.jpeg?region=439%2C0%2C661%2C663",
    "detail": "Ion weapons fire ionized particles that disrupt electronic systems. These weapons range in size from Jawas’ custom ion blasters, used to disable droids, to massive cannons that can turn starships into silent, drifting hulks. During the Clone Wars, the Separatists mounted twin ion cannons on the dreadnought Malevolence, which laid waste to several Republic task forces before her destruction. Years later, the Alliance defended Hoth’s Echo Base with a powerful surface-mounted ion cannon."
  },
  {
    "name": "   ion restraining bolt  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/solo-db-ion-restraining-bolt-main-image_61315c18.jpeg?region=266%2C0%2C878%2C878",
    "detail": "Larger versions of the tools used to restrict droids’ behavior, ion restraining bolts are used to lock down starships so that they can’t lift off – typically in cases where a captain has failed to outrun debts. The Millennium Falcon was locked down with such a device while on Vandor – a detail Lando Calrissian preferred not to share with potential business partners."
  },
  {
    "name": "   Jannah’s bow  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/jannah-s-bow-main_b9a71c52.jpeg?region=296%2C0%2C537%2C536",
    "detail": "After Company 77 found a home on Kef Bir, Jannah created a powered bow from stripped down blaster-rifle components and handcrafted elements, such as a carefully smoothed and finished driftwood riser. This weapon has field projectors that increase the distance, speed and accuracy of her shots. She has crafted similar bows for other members of her company. "
  },
  {
    "name": "   Jedi Breathing Device  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/databank_jedibreathingdevice_01_169_9c976d1b.jpeg?region=222%2C0%2C878%2C878",
    "detail": "A small breather that fits snugly into a Jedi Knight's utility belt, the A99 aquata breather is a compact mouthpiece designed to supply its wearer with a breathable gas. The A99 has advanced filters to allow it to function underwater, in a vacuum, and in certain poisonous environments. The A99 has a number of variants to accommodate a variety of alien physiologies. The A99's miniature compressed air tanks can supply two hours of oxygen."
  },
  {
    "name": "   Jedi holocron  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/Holocron_6d6b7de1.jpeg?region=390%2C0%2C1080%2C1080",
    "detail": "Holocrons are ancient repositories of knowledge and wisdom that can only be accessed by those skilled in the Force. Jedi use them to record and preserve their teachings, creating a record for future generations seeking to understand the mysteries of the Force. During the time of the Republic, countless holocrons were stored on Coruscant; after the Jedi purge, however, they became scarce remnants of an era long gone."
  },
  {
    "name": "   Jedi Mind Trick  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/databank_jedimindtrick_01_169_a491266d.jpeg?region=425%2C0%2C878%2C878",
    "detail": "The Force can have a powerful effect on the weak-minded, a phenomenon Jedi sometimes take advantage of in pursuing their missions. An experienced Jedi can use the Force to implant a suggestion in the minds of those they encounter, encouraging them to comply with the Jedi’s wishes."
  },
  {
    "name": "   Jyn Erso's BlasTech A-180 Blaster  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/jyn-ersos-blaster-main_00716e3a.jpeg?region=341%2C0%2C878%2C878",
    "detail": "Jyn Erso has survived by being observant, resourceful and light-fingered. When she learns she’s headed for the war zone of Jedha, she helps herself to a BlasTech A-180 pistol left unattended by one of Massassi base’s rebels – a weapon she’s permitted to keep, to the consternation of K-2SO."
  },
  {
    "name": "   Kanan's Lightsaber  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/image_523917a7.jpeg?region=420%2C0%2C1080%2C1080",
    "detail": "A survivor of Order 66, Kanan Jarrus hid his Jedi identity from all but those closest to him. Carrying a lightsaber openly would be too dangerous in the age of the Empire, so he kept his Jedi weapon in disparate pieces on his belt. Kanan would assemble his lightsaber, which had a blue plasma blade, only when necessary."
  },
  {
    "name": "   Ketsu's Staff  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/katsu_s-staff_65ffb955.jpeg?region=241%2C0%2C878%2C877",
    "detail": "A versatile weapon, Ketsu’s staff was deceptively deadly. It could act as both a blaster and close-combat tool. Ketsu carried her staff on her back, where she could quickly draw it and strike. While on mission to recover the droid EG-86, the bounty hunter used the weapon to take down a squad of stormtroopers and vault onto a starship."
  },
  {
    "name": "   Krennic's DT-29 Heavy Blaster Pistol  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/krennics-dt29-heavy-blaster-main-backup_20f444be.jpeg?region=341%2C0%2C878%2C878",
    "detail": "Orson Krennic believes in leading from the front, and his instinct is to order troops to follow him into danger rather than sending them to do his bidding. The action-oriented weapons director flouts both Imperial regulations and customs by carrying a DT-29 heavy blaster with a custom-fitted macroscope."
  },
  {
    "name": "   Krrsantan's knuckle dusters  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/krrsantan-s-knuckle-dusters-main_24630ebc.jpeg?region=447%2C0%2C537%2C536",
    "detail": "Having honed his ferocious fighting style in deadly gladiator pits, Krrsantan augments his already formidable strength with a set of custom-crafted heavy metal knuckle dusters. "
  },
  {
    "name": "   Kuruk’s blaster rifle  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/kuruks-blaster-rifle-main_cc992326.jpeg?region=280%2C0%2C720%2C720",
    "detail": "Kuruk’s customized weapon is ideal for sniping, as befits the best marksman of the Knights of Ren. It can also deliver plasma bolts through a pump-action launcher, and has a rapid-fire mode for close-quarters combat."
  },
  {
    "name": "   Kylo Ren's Lightsaber  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/kylo-rens-lightsaber_c28b67c6.jpeg?region=353%2C0%2C1040%2C1040",
    "detail": "Kylo Ren’s crossguard lightsaber is an ancient design that recalls weapons seen millennia ago during the Great Scourge of Malachor. The crossguard blades, or quillons, emerge from focusing crystal activators that split the lightsaber’s plasma stream into three channels, with the quillons appearing after the main blade ignites. The crossguard blades allow Ren’s saber to operate safely – his weapon is constructed around a dangerously flawed kyber crystal, which would be overloaded if not for the lateral plasma vents that create the quillons."
  },
  {
    "name": "   Kyuzo petars  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/solo-db-kyuzo-petars-main-image_8113ba99.jpeg?region=233%2C0%2C878%2C878",
    "detail": "A dedicated student of Teräs Käsi, in hand-to-hand combat Dryden Vos often wields a pair of custom-made Kyuzo petars. The sleek daggers serve a dual purpose, sporting a sharp tempered carbon edge that can be overlaid with a scintillating monomolecular laser at the flick of a switch. The slicing instruments were designed to fit his small human hands and specifically weighted to accentuate his fighting style."
  },
  {
    "name": "   Lando’s prod pistol  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/landos-prod-pistol-main_42088416.jpeg?region=253%2C0%2C720%2C720",
    "detail": "During Pasaana’s Festival of the Ancestors, Lando Calrissian carries a custom-crafted prod pistol for protection. This weapon uses a bowstring to fire armor-piercing bolts. Its lack of a power pack means it won’t set off blaster detectors – Lando has learned the value of keeping a low profile."
  },
  {
    "name": "   Lasan Honor Guard AB-75 Bo-Rifle  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/image_bd5321b0.jpeg?region=420%2C0%2C1080%2C1080",
    "detail": "The AB-75 bo-rifle was the weapon of the Lasan Honor Guard, featuring a blaster barrel, bayonet, and electromagnetic pulse-generator tip. It required a great degree of skill to wield; Agent Kallus of the Imperial Security Bureau took an AB-75 from a fallen Lasat Honor Guard he defeated in battle. While a bo-rifle was a powerful weapon, its uses stemmed beyond combat. Zeb, the Lasat rebel, used his bo-rifle to complete an ancient ritual: the blaster-staff, shooting beams of yellow energy, led the Ghost through an anomaly and directly to Lirasan, the fabled Lasat homeworld."
  },
  {
    "name": "   Laser Ax  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/tlj-laser-ax_6e15843e.jpeg?region=458%2C0%2C877%2C878",
    "detail": "First Order stormtroopers assigned to execution duty carry grim tools of their trade: stout laser axes whose ends split into four emitter claws. A cycling ribbon of monomolecular energy pulses between each pair of claws, and can cut through virtually anything."
  },
  {
    "name": "   Lightsaber  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/Lightsaber_853fb596.jpeg?region=178%2C0%2C813%2C812",
    "detail": "The lightsaber is the weapon of a Jedi, an elegant weapon of a more civilized age. It can be used to cut through blast doors or enemies alike. Using the Force, a Jedi can predict and deflect incoming blaster bolts, and reflect them."
  },
  {
    "name": "   Lightsaber Pike  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/databank_lightsaberpike_01_169_c0e0248b.jpeg?region=0%2C0%2C878%2C878",
    "detail": "Similar to the double-bladed lightsaber, the lightsaber pike featured two blades (yellow hued) at each end of a staff. It was used by the Jedi Temple Guards."
  },
  {
    "name": "   Lobot-Tech Headgear  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/image_858301cd.jpeg?region=420%2C0%2C1080%2C1080",
    "detail": "Lobot-Tech headgear was an Imperial technology designed to increase productivity in low-level workers. The cybernetic implant, however, would often erase the personality of its subject and, occasionally, cause their behavior to become erratic. Lando Calrissian's aide utilized the technology, as did a Rodian named Tseebo, who used the Lobot-Tech headgear to steal Imperial data and plans."
  },
  {
    "name": "   Lord Corvax’s Lightsaber  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/lord-corvax-s-lioghtsaber-main_75d03768.jpeg?region=82%2C0%2C720%2C720",
    "detail": "Lightsabers are historically the weapon of a Jedi. This particular model belonged to Lord Corvax before he fell in battle. "
  },
  {
    "name": "   Luke Skywalker's Lightsaber (Green Blade)  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/luke-skywalkers-lightsaber-main-b_b94c2eb9.jpeg?region=313%2C0%2C720%2C720",
    "detail": "After losing his father’s lightsaber on Cloud City, Luke Skywalker constructed a replacement with a green plasma blade, its hilt similar to that of Obi-Wan Kenobi’s weapon. Luke hid his lightsaber inside R2-D2’s dome during his mission to rescue Han Solo from Jabba the Hutt, and surrendered the weapon to Darth Vader as part of his effort to reawaken the spirit of Anakin Skywalker."
  },
  {
    "name": "   Mace Windu's Lightsaber  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/mace-windus-lightsaber-1-1_5af932e0.jpeg?region=0%2C0%2C1000%2C1000",
    "detail": "Mace Windu was one of the most distinctive members of the Jedi Order, so it was only logical that he carried one of the most distinctive Jedi weapons. Windu’s saber had a plasma blade of amethyst – a brilliant warning to enemies that the Jedi Order’s greatest champion was ready for battle."
  },
  {
    "name": "   Magnetic climbers  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/rebels-databank-410-magnetic-climber-main-image_556f1e04.jpeg?region=164%2C0%2C720%2C720",
    "detail": "Capable of supporting tremendous weight, magnetic climbers are used to scale metallic surfaces, allowing a skilled climber to reach the highest peaks."
  },
  {
    "name": "   Magno-mine  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/magno-mine_5d7f496f.jpeg?region=458%2C0%2C877%2C878",
    "detail": "A magno-mine was a magnetized, deep-space explosive that could be attached to a ship and detonated remotely. With a large blast radius, the Empire utilized magno-mines to cause maximum damage during battles involving multiple enemy ships. The devices could be disarmed and re-engaged, however, which Admiral Konstantine found out when the Ghost crew and Iron Squadron used the commander’s own weapon against him."
  },
  {
    "name": "   Mandalorian Vambraces  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/mandalorian-vambraces_9235fbad.jpeg?region=585%2C0%2C878%2C878",
    "detail": "Designed to combat the abilities of a Jedi, the Mandalorian vambrace typically featured a grappling line, paralyzing darts, and repulsors. They were often worn in pairs, one on each forearm, and were great assets in combat -- though they provided no protection from the blade of a lightsaber."
  },
  {
    "name": "   Mandalorian vault  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/mandalorian-vault-main_08cfacb4.jpeg?region=368%2C0%2C544%2C544",
    "detail": "The proud warriors of Mandalore have many ways of dealing with off-world intruders. For a time, they dealt with Force-wielding enemies in particular through powerful technology, including encasing their foes in a vault-like prison that could be hauled from place to place much like a slab of carbonite."
  },
  {
    "name": "   Mando's blaster  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/mando-s-blaster-main_copy_ce227c44.jpeg?region=471%2C0%2C538%2C536",
    "detail": "The Mandalorian's IB-94 blaster pistol is a rare model with impressive range and firepower. It is an essential tool to his survival in the galaxy's rougher corners. "
  },
  {
    "name": "   Maz's Curio Box  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/maz-curio-box_8bfe146f.jpeg?region=469%2C0%2C655%2C653",
    "detail": "In her long centuries traveling the galaxy, Maz Kanata has collected any number of antiques and trinkets, stashing them in storehouses and vaults in her castle. Some of her dearest treasures – including a lightsaber built by Anakin Skywalker -- can be found in an old wood curio box, kept unlocked. Maz protects objects that speak to her through the Force, certain that one day the Force will in turn guide other seekers to find these relics."
  },
  {
    "name": "   Mechno-arms  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/mechno-arm_29447022.jpeg?region=477%2C0%2C666%2C664",
    "detail": "Mechno-arms were cybernetic replacements to hands and arms lost in a variety of situations, but more often than not by lightsaber blades. After Count Dooku severed the right arm of Anakin Skywalker in the opening battle of the Clone War, a mechno-arm was grafted to what was left. Luke Skywalker had much of one grafted to his wrist after Darth Vader severed his hand at Cloud City. Mechno-limbs were much stronger than organic limbs and thanks to an electrostatic fingertip system, users were able to retain their sense of touch. They could also be covered over in synthetic skin for a more realistic appearance."
  },
  {
    "name": "   Medical capsules  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/medical-capsules-main_3d843caf.jpeg?region=369%2C0%2C542%2C542",
    "detail": "Oblong glass medical capsules can be used for a variety of needs on the world of Kamino and beyond. In the years before the Clone Wars, such scientific wonders were essential in growing a massive clone army, ensuring soldiers were engineered to meticulous standards."
  },
  {
    "name": "   modified MK sniper rifle  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/modified-mk-sniper-rifle-main_9922bb16.jpeg?region=418%2C0%2C538%2C536",
    "detail": "For long-range hunting, the elite assassin Fennec Shand favors a modified MK sniper rifle, disabling her targets with deadly precision without giving away her position."
  },
  {
    "name": "   Moisture Vaporator  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/moisture-vaporator_2a7a7b05.jpeg?region=0%2C0%2C1022%2C1025",
    "detail": "Found on desert planets, moisture vaporators were stationary devices that could collected moisture from even the driest of climes. Though they were stationary, they included programming that offered them a binary language that could be used to communicate with droids. On the desert planet of Tatooine, edible mushrooms frequently grew on the vaporators. For moisture farmers to make a living, they would need fields of moisture vaporators, and then security systems to protect them for those who might steal their water."
  },
  {
    "name": "   Moloch's staff  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/solo-db-molochs-staff-featured-image_91afebad.jpeg?region=198%2C33%2C845%2C845",
    "detail": "Moloch carries a curious scepter topped with a clublike head adorned with carvings of writhing scrumrats – an emblem of the Grindalid enforcer’s belief in an afterlife filled with riches. Moloch’s staff is an object of morbid fascination for many scrumrats, who discuss its origins and significance in hushed tones."
  },
  {
    "name": "   Nightsister Crystal Ball  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/nightsister-crystal-ball_fa5fed3e.jpeg?region=555%2C0%2C607%2C606",
    "detail": "The Nightsisters of Dathomir tap into deep, dark wells of the Force that were virtually unknown to those who clung to the teachings of the Jedi or Sith. With their unique connection to the Force, Mother Talzin was able to craft a crystal ball to see visions of the future or to locate individuals such as Savage Opress or Darth Maul."
  },
  {
    "name": "   Obi-Wan Kenobi's Lightsabers  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/obi-wans-lightsabers-1-1_95bdd151.jpeg?region=65%2C0%2C662%2C661",
    "detail": "During his years as a Jedi, Obi-Wan Kenobi fought with three lightsabers. His first had a blue plasma blade and a hilt similar to that of his master, Qui-Gon Jinn. Obi-Wan used this weapon until Darth Maul kicked it into a deep shaft on Naboo. He then constructed a new, blue-bladed lightsaber with a similar design. After attaining the rank of Jedi Master, Obi-Wan built a third saber, also with a blue plasma blade. He used this saber until he sacrificed his life aboard the Death Star, allowing himself to be struck down by Darth Vader so Luke Skywalker could escape."
  },
  {
    "name": "   Orbital Bombardment Cannon  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/tlj-db-orbital-bombardment-cannon_91744b78.jpeg?region=647%2C0%2C878%2C878",
    "detail": "Orbital bombardment cannons such as those sported by the First Order Siege Dreadnought Fulminatrix pack enough firepower to blast through planetary shields and incinerate targets on the ground – a dangerous new advance in warships’ capabilities."
  },
  {
    "name": "   ordnance launcher  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/solo-db-ordanence-launcher-main-image_a9d3daef.jpeg?region=341%2C0%2C878%2C878",
    "detail": "Enfys Nest’s Cloud-Riders rarely seek to destroy their targets; rather, they immobilize opponents so they can plunder cargoes at their leisure. A typical Cloud-Rider weapon is the Merr-Sonn Munitions K21C portable ordnance launcher, loaded with cable-rockets for binding enemies."
  },
  {
    "name": "   Oxygen Mask  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/oxygen-mask_dead3232.jpeg?region=414%2C0%2C878%2C878",
    "detail": "Small, portable, and hands-free, oxygen masks were essential for deep space travel that might require out-of-ship activity. They could allow one to breathe in a low-oxygen atmosphere, but were not suitable for outer-space use."
  },
  {
    "name": "   Palpatine's lightsaber  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/palpatines-lightsaber_c261c820.jpeg?region=380%2C0%2C800%2C800",
    "detail": "In his guise as Supreme Chancellor Palpatine, Darth Sidious owned twin lightsabers constructed of phrik, auordium and electrum. Sidious rarely used these elegant weapons, preferring to manipulate events indirectly and in secret. He wielded two lightsabers against his renegade apprentice Darth Maul and Savage Opress on Mandalore, took up arms to battle the Jedi on Coruscant, and used one of his crimson blades against his enemies on Ryloth."
  },
  {
    "name": "   Percussive Cannon  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/solo-db-percussive-cannon-main-image-square_523c7137.jpeg?region=0%2C0%2C1500%2C1500",
    "detail": "Dryden Vos’s Hylobon security guards use these heavy blasters manufactured by Tostovin Munitions, with a black finish and stylish gold accents. The JND-41 has enough stopping power to eliminate any threat to the Crimson Dawn chief."
  },
  {
    "name": "   Phase Connector  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/resistance-db-phase-connector-main-image_79e9dedf.jpeg?region=341%2C0%2C878%2C878",
    "detail": "A part as rare as it is valuable, phase connectors can be used for many different jobs including drilling, excavating, and cracking open asteroids and small planetoids for heavy mining. Such tools are coveted by the mining guild as well as the First Order."
  },
  {
    "name": "   Police glow rod  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/tlj-db-police-glow-rod-main-image_66f25da6.jpeg?region=0%2C0%2C432%2C432",
    "detail": "The Canto Bight Police Department issues high-intensity glow rods to its officers to illuminate crime scenes. The glow rod is effective across many spectra, and its hilt can be used as a baton to subdue disturbers of the peace."
  },
  {
    "name": "   Power generator  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/power-generators_5d253eeb.jpeg?region=539%2C0%2C877%2C878",
    "detail": "Power generators were essential for remote worlds, particularly those with harsh or frigid climates. They were very rare — and expensive — making them hot commodities on the black market. Crime lords like Azmorigan and pirates like Hondo Ohnaka would deal power generators for often outrageous markups."
  },
  {
    "name": "   Proton bomb  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/tlj-db-proton-bomb_c70c881b.jpeg?region=997%2C314%2C563%2C564",
    "detail": "Resistance bombers carry more than 1,000 proton bombs in racks that fill a modular magazine beneath the hull. On a bombardier’s signal, the bomb-bay doors open and the magnetized charges are drawn towards the target below. Resistance crew members often decorate proton bombs with cartoons or defiant messages aimed at the First Order."
  },
  {
    "name": "   Proton Torpedo  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/star-wars-the-bad-batch-reunion-story-gallery-05_bcdacf4c.jpeg?region=162%2C9%2C494%2C493",
    "detail": "Proton torpedoes are energy missiles, common ordinance on starships throughout history. Even in a time of peace, spacecraft in the Royal Naboo armada were armed with the weapons, used to defeat the Trade Federation during the attempted invasion of the planet. During the Clone Wars, Jedi Cruisers were equipped with bays filled with proton torpedoes to help the Republic take out enemy ships in battle. After the rise of the Empire, the Bad Batch discovers a cache of the weaponry in the scrapyards of Bracca. And with the birth of the Rebel Alliance, squadrons of X-wing fighters use proton torpedoes to fight Imperial targets, famously destroying the first Death Star with the careful targeting of a pair of proton torpedoes fired directly into a thermal exhaust port."
  },
  {
    "name": "   Qui-Gon's lightsaber  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/qui-gon-jinns-lightsaber_de362907.jpeg?region=339%2C0%2C671%2C669",
    "detail": "Qui-Gon Jinn’s simple yet elegant lightsaber served him in many conflicts. The maverick Jedi designed his green-bladed saber to imitate the weapon of his master, Count Dooku; Qui-Gon’s saber, in turn, inspired the design of Obi-Wan Kenobi’s first Jedi weapon. Obi-Wan recovered Qui-Gon’s lightsaber after his master was killed by Darth Maul on Naboo."
  },
  {
    "name": "   Razor Crest's Arsenal  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/razor-crest-s-arsenal-main_68d42bf7.jpeg?region=372%2C0%2C536%2C536",
    "detail": "On the Razor Crest, the Mandalorian keeps a veritable arsenal behind locked doors, with everything from easy-to-conceal blasters to thermal detonators. "
  },
  {
    "name": "   Rebolt’s Staff  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/solo-db-rebolts-staff-main-image_25a68b59.jpeg?region=396%2C0%2C878%2C878",
    "detail": "Moloch’s goon Rebolt administers justice with a crude but effective bludgeoning club fashioned from a snapped transmission mast. Rebolt has nicknamed his staff the “Commander of Staves,” a nod to the sabacc face card, and cruelly delivers an extra jolt from time to time with the added boost from a power cell."
  },
  {
    "name": "   Restraining Bolt  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/screen_shot_2015-08-10_at_10_fbc45d84.jpeg?region=463%2C0%2C553%2C550",
    "detail": "A restraining bolt is a small cylindrical device that restricts a droid’s actions when connected to its systems. Droid owners install restraining bolts to limit actions to a set of desired behaviors. Restraining bolts work in conjunction with droid “callers,” small handheld devices that compel a droid to stop what it’s doing and report to its master."
  },
  {
    "name": "   Rey's Blaster  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/reys-blaster_47232736.jpeg?region=42%2C0%2C1040%2C1040",
    "detail": "After their arrival on Takodana, Han Solo gives Rey a compact but deadly blaster, impressed by the Jakku scavenger’s resourcefulness and cool in perilous situations. Rey used the blaster, an LPA NN-14, against the soldiers of the First Order when they attacked Maz’s castle"
  },
  {
    "name": "   Rey's Quarterstaff  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/reys-quarterstaff_56cc732c.jpeg?region=199%2C0%2C1040%2C1040",
    "detail": "Like nearly everything she owns, Rey’s quarterstaff is salvage from the wreckage that litters Jakku. Self-defense is a must for a Jakku scavenger, and Rey has won respect for her skills with her staff and her willingness to use it if crossed or threatened. That’s a lesson Unkar Plutt’s thugs discover the hard way when the junk boss orders them to take BB-8 from Rey. Rey’s years of practice at hand-to-hand fighting serves her well when she’s forced to use a lightsaber in combat."
  },
  {
    "name": "   RPS-6 Rocket Launcher  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/rps-6-rocket-launcher_20cb7a0f.jpeg?region=542%2C0%2C877%2C877",
    "detail": "The RPS-6 rocket launcher was a single-shot, shoulder-fired weapon, capable of great destruction but requiring expert aim. It was a favorite of clone trooper Gregor, who used the RPS-6 to destroy a TIE fighter from long range on Seelos."
  },
  {
    "name": "   RSKF-44 heavy blaster pistol  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/solo-db-rsk-44-main-image-square_a136676b.jpeg?region=0%2C0%2C1560%2C1560",
    "detail": "With his right hand, Tobias Beckett typically wields an RSKF-44 heavy blaster pistol, its business end ringed with colors left by oxidation from heat exposure. According to underworld rumor, the legendary bounty hunter Aurra Sing met her end because of Beckett’s pistols."
  },
  {
    "name": "   S-195 blaster pistol  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/solo-db-s-195-main-image-2_27e290d0.jpeg?region=564%2C0%2C878%2C878",
    "detail": "As Dryden Vos’s lieutenant in Crimson Dawn, Qi’ra’s weapon of choice is a Monlitzer S-195 blaster pistol. This double-barreled weapon is lightweight, with a hinged assembly that allows for quick loading of reactant gas capsules or power plugs."
  },
  {
    "name": "   Sabacc  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/sabacc-main_36deea02.jpeg?region=346%2C0%2C868%2C868",
    "detail": "Perhaps the galaxy’s oldest and most popular card game, sabacc is played in a bewildering number of variations. All place a premium on betting and bluffing, and many include an element of chance that can turn a good hand into a bad one – or vice versa. The Millennium Falcon changed hands in a famous sabacc game between Han Solo and Lando Calrissian."
  },
  {
    "name": "   Sabine’s lightsaber  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/sabines-lightsaber-main_e48d6611.jpeg?region=637%2C1%2C806%2C803",
    "detail": "Built by the Jedi Padawan Ezra Bridger while he studied under Kanan Jarrus, the green-bladed lightsaber has since become the weapon of Bridger’s longtime friend, Sabine Wren. A student who studied under Ahsoka Tano, Wren has made some custom modifications to its hilt, including a guard to protect her hands from the base of the blade."
  },
  {
    "name": "   SE-14 blaster pistol  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/solo-db-se-14r-main-image_022caaa8.jpeg?region=0%2C0%2C713%2C713",
    "detail": "BlasTech’s SE-14 blaster pistols are popular across the galaxy because of their high rate of fire and easy disassembly for maintenance. Jyn Erso gave the reprogrammed Imperial security droid K-2SO an SE-14C blaster pistol on Scarif. A young Lando Calrissian favored a stylish SE-14r repeating blaster plated with brushed chromium and featuring a mother-of-pearl grip."
  },
  {
    "name": "   Seismic Charge  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/seismic-charge_0d585f31.jpeg?region=450%2C0%2C661%2C661",
    "detail": "Seismic charges were devastating weapons that drew sound in from their immediate vicinity and exploded in concussive waves of brilliant blue light, shattering everything in its wake. Jango Fett outfitted them on the Slave I and did his best to kill Obi-Wan Kenobi in the orbit of Geonosis with them."
  },
  {
    "name": "   Self-Propelled Heavy Artillery Turbolaser (SPHA-T)  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/self-propelled-heavy-artillery-turbolaser_1d69d1e5.jpeg?region=260%2C0%2C1040%2C1040",
    "detail": "These twelve-legged gun platforms are the largest ground based weapons in the arsenal of the Republic army. It takes no less than 30 clone troopers to man the monstrous turbolaser beams, but they are powerful and effective enough to blast through starship shields and hulls."
  },
  {
    "name": "   Separatist Encryption Module  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/acw_ia_107443_aa71aa69.jpeg?region=840%2C0%2C807%2C805",
    "detail": "An experimental piece of Separatist technology, this compact palm-sized encryption module created an unbreakable code that scrambled Separatist transmissions, preventing the Republic from intercepting vital intelligence. Republic analysts were able to decipher that these transmissions came from General Grievous, and portended a devastating strike against the Republic, but any solid information remained agonizingly out of reach. To that end, the Republic launched a special mission to recover the device from the heart of a Separatist dreadnought."
  },
  {
    "name": "   Shield Generators  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/shield-generators-main-image_54a8a93d.jpeg?region=0%2C0%2C878%2C878",
    "detail": "Developed by Kuat Drive Yards, these military grade shield generators were a hot commodity on the black market. Thanks to hover capabilities, the Colicoid 49-v99 Deflector models were easily portable and could be moved from ship to ship. The Lothal rebels managed to steal an Imperial stockpile of the shield generators, and traded several to Lando Calrissian for passage off the planet."
  },
  {
    "name": "   Simulator pods  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/main-image_7d58a5cb.jpeg?region=534%2C0%2C878%2C878",
    "detail": "The Empire utilized simulator pods to run their cadets through specific scenarios and training missions. The pods were, essentially, standalone cockpit pods of TIE fighters; they could be moved a full 360 degrees to recreate the experience of flying a TIE, and featured immersive, on-screen visuals that could be monitored by instructors."
  },
  {
    "name": "   Sinrich optical dephaser  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/rebels-databank-411-sinrich-optical-dephaser-main-image_6f893c82.jpeg?region=280%2C0%2C720%2C720",
    "detail": "Extremely rare technology, a Sinrich optical dephaser is a small-scale cloaking device. Its uses vary from vehicular cloaking to invisible camouflage for hunting and hand-to-hand combat."
  },
  {
    "name": "   Sith holocron  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/sith-holocron_fa76c67c.jpeg?region=187%2C0%2C877%2C878",
    "detail": "Sith holocrons hold knowledge and wisdom that can only be accessed by dark side practitioners. The artifacts can also be used as keys to unlock temple doors. The Sith temple on Malachor was the home of a Sith holocron that Maul attempted to steal with the help of Ezra Bridger. When placed in the temple's obelisk, the holocron could create a super weapon, designed to take life. Maul's plans were foiled, however, when Ezra and his Master Kanan were able to pull the holocron from the obelisk just in time."
  },
  {
    "name": "   Sith Relic  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/zro-ff-003450_c7a215b6.jpeg?region=0%2C0%2C720%2C720",
    "detail": "Little is known about the Sith relic recovered at the Temple of the Force on Ashas Ree. Seated in a place of honor inside the dusty crypt, the carved face of its golden facade gleaming, the ancient totem is protected by a series of traps and puzzles. But once captured, it can be activated to emit a staggering dark power that will kill all life in its path."
  },
  {
    "name": "   Sith wayfinder  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/sith-wayfinder-main_5d4766ac.jpeg?region=516%2C0%2C537%2C536",
    "detail": "Long ago, wayfinders helped both Jedi and Sith navigate a largely uncharted galaxy. Navicomputers have made wayfinders obsolete, but these devices preserve ancient routes to planets whose locations were secret or have been lost. Darth Vader and Darth Sidious each possessed a Sith wayfinder pointing the way to the legendary Sith redoubt of Exegol, making these twin artifacts invaluable prizes in the battle to control the galaxy. "
  },
  {
    "name": "   Skywalker lightsaber  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/skywalker-lightsaber-main_e9de18dc.jpeg?region=213%2C0%2C854%2C854",
    "detail": "Anakin Skywalker carried this blue-bladed Jedi weapon throughout the Clone Wars. After dueling his former apprentice on Mustafar, Obi-Wan Kenobi took Anakin’s lightsaber and kept it on Tatooine for nearly two decades. He gave it to Luke Skywalker, who lost it when Darth Vader struck off his son’s hand in Cloud City. The lightsaber then became part of Maz Kanata’s collection of Jedi curios, where it called to the scavenger Rey. She wielded it in defeating Kylo Ren, then brought it to Ahch-To and offered it back to Luke. When he refused it, Rey carried the ancient weapon herself. The lightsaber sheared apart when Rey and Kylo struggled for possession of it aboard the Supremacy, but Rey reforged it as she continued her Jedi training."
  },
  {
    "name": "   Smoke Bomb  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/image_ba610557.jpeg?region=480%2C0%2C960%2C960",
    "detail": "Not physically harmful, smoke bombs are employed to create diversions and/or provide cover. Smoke bombs, which unleash clouds of dark smoke, come in many shapes, sizes, and formats -- some can be detonated with a timer, while others explode on impact. Sabine Wren of the Ghost crew made ample use of them during battles with the Empire."
  },
  {
    "name": "   snubble pistol  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/solo-db-snubble-pistol-main-image_7e535067.jpeg?region=274%2C0%2C878%2C878",
    "detail": "Moloch uses this double-barreled snub pistol to enforce Lady Proxima’s will among her scrumrats and any who might try to cross the White Worm matriarch. Moloch altered his weapon to have no stun setting – if he draws it, he means business."
  },
  {
    "name": "   Sub-loop spanner  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/resistance-db-subloop-spanner-main-image_deb66210.jpeg?region=111%2C0%2C878%2C878",
    "detail": "Working in Jarek Yeager's shop as a mechanic proves difficult for those who are unfamiliar with basic tools of the trade. The wrong implement utilized in place of a sub-loop spanner can have electrifying side effects."
  },
  {
    "name": "   SX-21 Blaster Rifle  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/solo-db-sx-21-blaster-rifle-main-image_3d197ca1.jpeg?region=526%2C0%2C878%2C878",
    "detail": "A pump-action scatter blaster rifle made by Merr-Sonn Munitions, the SX-21 proved valuable to Imperial mudtroopers in the tough fighting against Mimban’s native insurgents. When he escaped Imperial captivity, Chewbacca used an SX-21 as a temporary substitute for the bowcaster favored by Wookiee warriors."
  },
  {
    "name": "   T-7 Ion Disruptor Rifles  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/image_8caf8b3a.jpeg?region=163%2C0%2C1080%2C1080",
    "detail": "T-7 ion disruptor rifles were deadly, powerful weapons capable of disabling starships; when used against organic beings, the results could be gruesome. As a result, they were banned by the Senate. During the age of the Empire, Imperial forces used the disruptors to clear out worlds and, sometimes, slaughter their inhabitants, as was the case with their takeover of Lasan."
  },
  {
    "name": "   The Armorer's Equipment  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/the-armorer-s-equipment-main_89863b97.jpeg?region=202%2C0%2C538%2C536",
    "detail": "The deftly skilled Armorer's cryo-furnace utilizes an assortment of tools of the trade, from magnetic tongs to a precise gravity hammer, to forge armor in the tradition of the Mandalorian ancestors."
  },
  {
    "name": "   The Box  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/the-box_3332c950.jpeg?region=449%2C0%2C663%2C663",
    "detail": "Designed by the criminal mastermind Moralo Eval, the Box was a lethal simulator designed to test the suitability of a dozen bounty hunters for a secret Separatist mission to kidnap Supreme Chancellor Palpatine on Naboo. The Box was located deep inside Count Dooku’s palace on his home world of Serreno."
  },
  {
    "name": "   the Decimator  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/the-decimator-main_706edb34.jpeg?region=547%2C1%2C546%2C544",
    "detail": "With a laser capable of drilling through thick metal doors, the floating sphere known as the Decimator is equipped for burrowing into sealed-off hiding spots and unleashing a blast of crackling energy to annihilate any organic creatures that may stand in its way."
  },
  {
    "name": "   The Duchess  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/the-duchess_bce020b2.jpeg?region=0%2C0%2C878%2C878",
    "detail": "Designed by rebel and former Imperial cadet Sabine Wren, the Duchess is a devastating Imperial weapon. It targets Mandalorian armor, superheating it and instantly vaporizing the target."
  },
  {
    "name": "   The Grand Inquisitor's Lightsaber  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/image_253e49bc.jpeg?region=350%2C0%2C900%2C900",
    "detail": "The Grand Inquisitor, the Empire's ruthless Jedi hunter, carried a lightsaber built to destroy. The weapon featured dual modes, crescent and disc, in addition to some deadly surprises. In its crescent setting, the lightsaber had a single red blade; in disc mode, a second blade emerged, and a spin feature turned the lightsaber in a blindingly fast killing tool. The Grand Inquisitor relished combat, and his weapon proved very effective at intimidating, disorienting, and dispatching his enemies."
  },
  {
    "name": "   Thermal Detonator  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/databank_thermaldetonator_01_169_263981fd.jpeg?region=383%2C0%2C876%2C878",
    "detail": "Thermal detonators are grenade-like weapons that pack tremendous explosive power into a small sphere, and are used by bounty hunters and military forces such as the Empire’s stormtroopers. Cad Bane used thermal detonators during his assault on the Senate Building; a generation later, Princess Leia threatened Jabba the Hutt with a thermal detonator while disguised as the Ubese hunter Boushh."
  },
  {
    "name": "   tool caddy  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/tool-caddy-main_c4b0b550.jpeg?region=372%2C0%2C536%2C536",
    "detail": "A ranch owner like Kuiil the Ugnaught must be adept at making his own repairs to droids and ranch machinery. Most of the time, he keeps the necessary tools at hand in a floating caddy, but the small receptacle can serve other purposes in a pinch."
  },
  {
    "name": "   Training Remote  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/training-remote-mian_4bd27e1b.jpeg?region=364%2C0%2C536%2C536",
    "detail": "These miniature droids are used in combat training, darting back and forth on repulsors and firing sting beams that can be set for a variety of intensity levels. Both younglings and established Jedi trained with remotes, using them as teaching tools for avoiding blaster bolts and deflecting them with lightsabers."
  },
  {
    "name": "   Transponders  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/transponders-main-image_7f8c54d4.jpeg?region=398%2C0%2C878%2C878",
    "detail": "Masking transponders, made by the Corellian Engineering Corporation, were used to transmit ship identification data; they were reprogrammable so that they could project false profiles for those who wished to not be seen. When the Ghost rebels needed to escape Lothal, they used Lando Calrissian’s transponders to send out the same signal throughout the planet. As a result, the Empire was confused, and their ships were forced to investigate each signal. This gave the rebels the opportunity they needed to jump into hyperspace."
  },
  {
    "name": "   Trudgen’s vibrocleaver  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/trudgens-vibro-cleaver-main_e9660f55.jpeg?region=411%2C0%2C720%2C720",
    "detail": "Trudgen’s massive vibrocleaver is an intimidating weapon even before its wielder activates its ultrasonic capabilities. Trudgen often carries his great blade propped on one shoulder, a promise of devastation that reduces his enemies to quaking fear."
  },
  {
    "name": "   Tusken Adze  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/tusken-adze-main_99d74863.jpeg?region=333%2C0%2C538%2C536",
    "detail": "Tusken crafters use handmade tools to carefully hew sacred tree limbs into essential tools of survival, like their gaderffii weapons."
  },
  {
    "name": "   Tusken Ballista  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/tusken-ballista-main_2ea368a4.jpeg?region=680%2C0%2C538%2C538",
    "detail": "This primitive but effective weapon fires heavy bolts toward distant targets, defending against fiercer dangers than the sunstroke and dehydration normally faced by denizens of Tatooine."
  },
  {
    "name": "   Umbaran MHC  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/umbaran_mhc_743a0f27.png?region=198%2C0%2C391%2C391",
    "detail": "During the Republic campaign to secure Umbara, the natives of the shadowy world unleashed all manner of previously unseen advanced technology against the clone trooper forces. The Umbaran MHC -- mobile heavy cannon -- is a titanic juggernaut built atop six powerful, ground-shaking legs. The dome-shaped body of the spider-like tank is heavily armored, able to withstand anti-armor infantry rockets. Mounted atop the dome on an articulated arm is a powerful electromagnetic plasma cannon. The monstrous MHC has almost no weaknesses."
  },
  {
    "name": "   Ushar’s war club  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/ushars-war-club-main_5f8cddfe.jpeg?region=156%2C0%2C720%2C720",
    "detail": "A brutishly simple and effective weapon, Ushar’s war club is a studded length of metal topped with a pommel that can store and then unleash kinetic energy in a deadly concussive wave."
  },
  {
    "name": "   Vibro Ax  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/vibro_axe_dd4001cc.jpeg?region=224%2C0%2C1113%2C1113",
    "detail": "Axes are intimidating weapons and come in a number of varieties, but none are more fearsome than the Vibro-ax. They all boast blades like a standard axe, but come equipped with vibration generators that increase their lethality and cutting ability significantly. They’re the weapon of choice for Gamorreans, but are wielded by any number of thugs who are looking for an advantage in melee combat."
  },
  {
    "name": "   vibro-arbir blades  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/tlj-vibro-arbir-blades-main-image_a5ce330b.jpeg?region=289%2C0%2C432%2C432",
    "detail": "One pair of Snoke’s Praetorian Guards wields twin vibro-arbir blades that can be joined at the ends to form a single double-bladed polearm or wielded independently in each hand. The blades’ metal edges are complemented by razor-sharp beams of electro-plasma."
  },
  {
    "name": "   vibro-voulge  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/last-jedi-databank-vibro-voulge-main-image_14f33fbe.jpeg?region=147%2C0%2C537%2C536",
    "detail": "Two of Snoke’s crimson-armored Praetorian Guards defend the Supreme Leader with axlike vibro-voulges, which can chop through an opponent. An ultrasonic generator in the weapon’s hilt gives it additional cutting power."
  },
  {
    "name": "   vibroblade  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/vibro-blade-main_ec04ec72.jpeg?region=627%2C0%2C537%2C536",
    "detail": "Among the Mandalorian's formidable arsenal of weapons in the vibroblade. Despite its simplicity, it can deliver a deadly blow."
  },
  {
    "name": "   Vicrul’s scythe  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/vicruls-sythe-main_e404bc44.jpeg?region=520%2C0%2C676%2C676",
    "detail": "Made of tough steel shot through with phrik and beskar, Vicrul’s trademark scythe channels vibrosonic energy to make it more lethal in combat. The “harvester” of the Knights of Ren also carries a blaster pistol for long-distance battles."
  },
  {
    "name": "   Vocal Emulator  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/databank_vocalemulator_01_169_2ba87603.jpeg?region=344%2C0%2C877%2C878",
    "detail": "A hard-to-come-by example of technology custom made for covert operations, a vocal emulator is a device used by spies to alter their voiceprint to a perfect duplicate of a sample subject. The small sphere records a sample of a target subject's voice, and tiny processors within analyze pitch, frequency, as well as intonation and inflection. The device then sprouts limbs to assist the spy in swallowing the emulator. The rigid tentacle like legs part the way through the throat and past the hyoid bone, to connect directly into the larynx."
  },
  {
    "name": "   whistling birds  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/whistling-birds-main_9e25a7ff.jpeg?region=591%2C0%2C538%2C536",
    "detail": "A Mandalorian's gadgetry can include many hidden elements to surprise their enemies. On the wrist bracers of their armor, a small flame thrower can be concealed as well as a marvel known as \"whistling birds,\" a flock of dart-like missiles loaded into the slender recessed sleeve."
  },
  {
    "name": "   Yoda's Lightsaber  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/yoda-s-lightsaber-main_9ebf17d9.jpeg?region=372%2C0%2C536%2C536",
    "detail": "Yoda rarely if ever drew his lightsaber, preferring to work in more subtle ways. But the Jedi Grandmaster remained a formidable warrior, as Count Dooku and Darth Sidious discovered when they confronted Yoda in battle. Yoda’s lightsaber was smaller than a standard Jedi lightsaber, befitting his shorter stature. But its green plasma blade was every bit as deadly in combat."
  },
  {
    "name": "   Z-6 Jetpack  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/z-6-jetpack_1b7c067e.jpeg?region=544%2C0%2C808%2C808",
    "detail": "The Z-6 Jetpack was the preferred jetpack of Mandalorian commandos across the galaxy, from the more organized sects like Death Watch to the outliers on the fringe, like Jango Fett and Boba Fett. They were fast and nimble and could maintain sustained flight as well as short bursts for tactical advantages in combat. The jetpacks could be equipped with a top-loaded rocket firing missile that could turn the tide in many a conflict. Their significant disadvantage was their vulnerability to external impact damage. One sharp blow with a stick could conceivably ignite the jetpack, causing all manner of unwanted performance that could lead to significant bodily harm or even death."
  },
  {
    "name": "   Z6 Riot Control Baton  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/z-6-riot-control-baton_35d6b0ec.jpeg?region=462%2C0%2C636%2C636",
    "detail": "The First Order’s stormtroopers are trained in riot-control tactics and the use of non-lethal equipment such as the Z6 baton. The baton has a magnetic grip, can be spun in combat and delivers a stunning shock. Troopers often use it in conjunction with a betaplast riot shield. On Takodana, FN-2199 used a Z6 baton against his former stormtrooper comrade FN-2187, better known as Finn."
  },
  {
    "name": "   Zorii Bliss’s blasters  ",
    "img": "https://lumiere-a.akamaihd.net/v1/images/zorii-bliss-s-blasters-main_7faba069.jpeg?region=262%2C0%2C536%2C535",
    "detail": "When the spice business demands aggressive negotiations, Zorii Bliss relies on a pair of twin E-851 blaster pistols kept at the ready in reverse-draw holsters. With their weighted grips, Zorii’s pistols resemble those of old-time space pirates – but their firepower is state of the art."
  }
]
